sangko-dgq/MCUTemplates/Template_STC/Template_ STC32G12K128/STC32G_dev_space/Example projects/STC32G-DEMO/DEMO/22-OLED小恐龙/Keil工程和代码/OLED_高刷新率图片显示/oled.h
#include <STC32G.h>
#ifndef __OLED_H
#define __OLED_H			  	 
 //#define MAIN_Fosc        11059200UL
#define  u8 unsigned char 
#define  u16 unsigned int 
	
#define UP 0										//方向定义：上
#define DOWN 1									//方向定义：下
#define LEFT 2										//方向定义：左
#define RIGHT 3										//方向定义：右

#define OLED_CMD  0			//写命令
#define OLED_DATA 1			//写数据
#define OLED_MODE 0

sbit OLED_SCL=P2^1;			// OLED SCLK 引脚
sbit OLED_SDIN=P2^0;		// OLED SDA	 引脚

#define OLED_CS_Clr()  OLED_CS=0
#define OLED_CS_Set()  OLED_CS=1
 
#define OLED_RST_Clr() OLED_RST=0
#define OLED_RST_Set() OLED_RST=1
 
#define OLED_DC_Clr() OLED_DC=0
#define OLED_DC_Set() OLED_DC=1
 
#define OLED_SCLK_Clr() OLED_SCL=0
#define OLED_SCLK_Set() OLED_SCL=1
 
#define OLED_SDIN_Clr() OLED_SDIN=0
#define OLED_SDIN_Set() OLED_SDIN=1
 
//OLED模式设置
//0:4线串行模式
//1:并行8080模式
 
#define SIZE 16
#define XLevelL		0x02
#define XLevelH		0x10
#define Max_Column	128
#define Max_Row		64
#define	Brightness	0xFF 
#define X_WIDTH 	128
#define Y_WIDTH 	64	    						  
//-----------------OLED端口定义----------------  					   
 
//OLED控制用函数
void OLED_WR_Byte(unsigned char dat,unsigned char cmd);  
void OLED_Display_On(void);
void OLED_Display_Off(void);	   							   		    
void OLED_Init(void);
void OLED_Clear(void);
//void OLED_DrawPoint(u8 x,u8 y,u8 t);
//void OLED_Fill(u8 x1,u8 y1,u8 x2,u8 y2,u8 dot);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 Char_Size);
void OLED_ShowNum(u8 x,u8 y,u16 num,u8 len,u8 size);
void OLED_ShowString(u8 x,u8 y, u8 *p,u8 Char_Size);	 
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(u8 x,u8 y,u8 no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
void OLED_DrawBMP_Fast(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
void OLED_DrawBMP_Faster(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
void BMPmove(unsigned char BMPx1,unsigned char BMPy1,unsigned char BMPx2,unsigned char BMPy2,unsigned char *BMPn,unsigned char BMPfx,unsigned int sudu);
void delay_ms(unsigned int ms);
//void Delay_50ms(unsigned int Del_50ms);
//void Delay_1ms(unsigned int Del_1ms);
void fill_picture(unsigned char fill_Data);
//void Picture();
void IIC_Start();
void IIC_Stop();
void Write_IIC_Command(unsigned char IIC_Command);
void Write_IIC_Data(unsigned char IIC_Data);
void Write_IIC_Byte(unsigned char IIC_Byte);
void IIC_Wait_Ack();
 
#endif  
	 
 
 
 